# DuctLining Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctLining Class
Members See Also
---
Represents Lining applied to the inside of a given duct, fitting or accessory.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class DuctLining : InsulationLiningBase
```

Visual Basic
---
```text
Public Class DuctLining _
	Inherits InsulationLiningBase
```

Visual C++
---
```text
public ref class DuctLining : public InsulationLiningBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB..::..InsulationLiningBase Autodesk.Revit.DB.Mechanical..::..DuctLining
# See Also
DuctLining Members
Autodesk.Revit.DB.Mechanical Namespace